# FabricWireLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricWireLength Property
ParameterTypeId Class See Also
---
"Wire length": The wire length
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricWireLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricWireLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricWireLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace